{
  "name": "COGS Color Optimized",
  "expression": [
    "",
    "/*",
    "    Business Goal: This measure does not return a numeric value but a color code (hex).",
    "    It is designed to be used in a report visual to conditionally format elements",
    "    (like KPI icons or font colors) based on the Year-over-Year (YoY) change in COGS.",
    "    It calculates the current COGS and the COGS from the same period last year,",
    "    computes the absolute difference, and returns a color based on whether COGS",
    "    decreased (good, green), increased (bad, red), or remained stable (gray).",
    "",
    "    Function Explanation:",
    "    VAR: Used to declare a variable that stores the result of a DAX expression.",
    "    Variables improve performance and readability by calculating a value once and reusing it.",
    "*/",
    "VAR Current_COGS = ",
    "    /*",
    "        IFERROR: Evaluates the first expression and returns it if no error occurs.",
    "        If an error is encountered, it returns the second expression (BLANK() in this case).",
    "        This ensures the measure is robust against calculation errors.",
    "    */",
    "    IFERROR( [COGS], BLANK() )",
    "",
    "VAR Previous_Year_COGS =",
    "    /*",
    "        CALCULATE: The primary function for context modification in DAX.",
    "        It evaluates an expression (IFERROR([COGS], BLANK())) in a modified filter context.",
    "        SAMEPERIODLASTYEAR: A time intelligence function that takes a date column and",
    "        returns a set of dates from the previous year corresponding to the current date context.",
    "        For example, if the current context is March 2024, it returns dates for March 2023.",
    "    */",
    "    CALCULATE (",
    "        IFERROR( [COGS], BLANK() ),",
    "        SAMEPERIODLASTYEAR ( 'Dates Optimized'[Date] )",
    "    )",
    "",
    "// Calculates the absolute Year-over-Year Change: Current Period - Previous Year",
    "VAR YoY_Change_Absolute = ",
    "    /*",
    "        COALESCE: Returns the first expression that does not evaluate to BLANK.",
    "        If the first expression is blank, it checks the second, and so on.",
    "        Here, it replaces BLANK values with 0 to ensure correct arithmetic operations.",
    "    */",
    "    COALESCE( Current_COGS, 0 ) - COALESCE( Previous_Year_COGS, 0 )",
    "",
    "RETURN",
    "    /*",
    "        SWITCH: Evaluates a list of conditions and returns one of multiple result expressions.",
    "        TRUE(): Used as the first argument to SWITCH to enable conditional logic based on the value of YoY_Change_Absolute.",
    "        This structure checks each condition in sequence and returns the corresponding color hex code.",
    "        - Green (#00A650) for a decrease in COGS (which is typically favorable).",
    "        - Red (#E60000) for an increase in COGS (which is typically unfavorable).",
    "        - Gray (#7F8C8D) for no change or if the value is BLANK (coerced to 0).",
    "    */",
    "    SWITCH (",
    "        TRUE(),",
    "        // Condition 1: COGS decreased (Green) - Favorable",
    "        YoY_Change_Absolute < 0, \"#00A650\", ",
    "        // Condition 2: COGS increased (Red) - Unfavorable",
    "        YoY_Change_Absolute > 0, \"#E60000\", ",
    "        // Condition 3: No change, 0, or BLANK (Gray) - Neutral",
    "        \"#7F8C8D\" ",
    "    )"
  ],
  "displayFolder": "cogs",
  "lineageTag": "dd0e1aa6-aebf-4c08-b5b4-36781208f866"
}