{
  "name": "Max Units Sold Optimized",
  "expression": [
    "",
    "/*",
    "    Business Goal: In a tabular visualization context, this measure returns the ",
    "    Units Sold value ONLY for the specific row (period) where the number of units ",
    "    reached its maximum value within the entire currently selected time period.",
    "    All other rows will display BLANK(). This creates a visual highlight that ",
    "    instantly identifies the peak volume period in the selected timeframe.",
    "",
    "    Function Explanation:",
    "    VAR: Used to declare variables that store intermediate calculation results.",
    "    This improves performance by calculating values once and reusing them.",
    "*/",
    "VAR Current_Units_Sold = ",
    "    /*",
    "        Retrieves the Units Sold value for the current filter context (e.g., for the current month/row).",
    "        This is evaluated in the context of each row in the visual and represents the units sold",
    "        for that specific period.",
    "    */",
    "    [Units Sold]",
    "VAR Max_Units_Sold_Value =",
    "    /*",
    "        MAXX: An iterator function that scans through a table and returns the maximum value",
    "        of an expression evaluated for each row.",
    "        ",
    "        ALLSELECTED: Returns all rows in a table while respecting the current user selections",
    "        from slicers, report filters, and other visual interactions. This ensures we calculate",
    "        the maximum units sold only within the timeframe the user is currently viewing.",
    "        ",
    "        Combined, this calculates the maximum Units Sold value across all dates that are",
    "        currently selected in the report. The variable is computed once and reused for",
    "        all row comparisons, providing significant performance optimization.",
    "    */",
    "    MAXX ( ALLSELECTED ( 'Dates Optimized' ), [Units Sold] )",
    "",
    "RETURN",
    "    /*",
    "        Two-layer conditional logic to control the final output:",
    "        - First, check if there's any Units Sold value in the current row",
    "        - Then, check if the current row's Units Sold equals the maximum Units Sold in the selected period",
    "    */",
    "    IF (",
    "        ISBLANK ( Current_Units_Sold ),",
    "        /*",
    "            ISBLANK: Returns TRUE if the Current_Units_Sold is BLANK.",
    "            If there's no Units Sold data for the current period, return BLANK to maintain",
    "            data cleanliness and avoid displaying misleading zeros.",
    "        */",
    "        BLANK (),",
    "        /*",
    "            Second IF: Compares the current row's Units Sold with the maximum Units Sold value.",
    "            If they are equal, this row contains the period with maximum sales volume.",
    "        */",
    "        IF (",
    "            Current_Units_Sold = Max_Units_Sold_Value,",
    "            /*",
    "                Returns the Current_Units_Sold value only for the row that contains",
    "                the maximum value. This creates a visual highlight where only the",
    "                peak volume period displays its units sold value, making it stand out.",
    "            */",
    "            Current_Units_Sold,",
    "            /*",
    "                Returns BLANK() for all rows that don't contain the maximum Units Sold value.",
    "                This creates a clean visual effect where only the peak volume period",
    "                is prominently displayed, facilitating quick volume analysis.",
    "            */",
    "            BLANK ()",
    "        )",
    "    )"
  ],
  "displayFolder": "units sold",
  "lineageTag": "a5e01ead-432f-4470-812b-6672f4e0f67d"
}