{
  "name": "Min Sales Optimized",
  "expression": [
    "",
    "/*",
    "    Business Goal: In a tabular visualization context (e.g., a month-by-month table),",
    "    this measure returns the Sales value ONLY for the specific row (period) where Sales",
    "    reached its minimum value within the entire currently selected time period (e.g., year).",
    "    All other rows will display BLANK(). This creates a visual highlight that instantly",
    "    identifies the lowest sales period in the selected timeframe, complementing the",
    "    \"Max Sales Optimized\" measure for comprehensive sales performance analysis.",
    "",
    "    Function Explanation:",
    "    VAR: Used to declare variables that store intermediate calculation results.",
    "    This improves performance by calculating values once and reusing them.",
    "*/",
    "VAR Current_Sales = ",
    "    /*",
    "        Retrieves the Sales value for the current filter context (e.g., for the current month/row).",
    "        This is evaluated in the context of each row in the visual and represents the sales",
    "        for that specific period.",
    "    */",
    "    [Sales]",
    "VAR Min_Sales_Value =",
    "    /*",
    "        MINX: An iterator function that scans through a table and returns the minimum value",
    "        of an expression evaluated for each row.",
    "        ",
    "        ALLSELECTED: Returns all rows in a table while respecting the current user selections",
    "        from slicers, report filters, and other visual interactions. This ensures we calculate",
    "        the minimum sales only within the timeframe the user is currently viewing.",
    "        ",
    "        Combined, this calculates the minimum Sales value across all dates that are",
    "        currently selected in the report. The variable is computed once and reused for",
    "        all row comparisons, providing significant performance optimization.",
    "    */",
    "    MINX ( ALLSELECTED ( 'Dates Optimized' ), [Sales] )",
    "",
    "RETURN",
    "    /*",
    "        Two-layer conditional logic to control the final output:",
    "        - First, check if there's any Sales value in the current row",
    "        - Then, check if the current row's Sales equals the minimum Sales in the selected period",
    "    */",
    "    IF (",
    "        ISBLANK ( Current_Sales ),",
    "        /*",
    "            ISBLANK: Returns TRUE if the Current_Sales is BLANK.",
    "            If there's no Sales data for the current period, return BLANK to maintain",
    "            data cleanliness and avoid displaying misleading information.",
    "        */",
    "        BLANK (),",
    "        /*",
    "            Second IF: Compares the current row's Sales with the minimum Sales value.",
    "            If they are equal, this row contains the period with minimum sales performance.",
    "        */",
    "        IF (",
    "            Current_Sales = Min_Sales_Value,",
    "            /*",
    "                Returns the Current_Sales value only for the row that contains",
    "                the minimum value. This creates a visual highlight where only the",
    "                lowest sales period displays its sales value, making it stand out",
    "                for further investigation or analysis.",
    "            */",
    "            Current_Sales,",
    "            /*",
    "                Returns BLANK() for all rows that don't contain the minimum Sales value.",
    "                This creates a clean visual effect where only the lowest sales period",
    "                is prominently displayed, helping identify potential problem areas",
    "                or seasonal troughs.",
    "            */",
    "            BLANK ()",
    "        )",
    "    )"
  ],
  "displayFolder": "sales",
  "lineageTag": "7fd58104-9f2e-433d-a25a-56ac0c7ae93a"
}