{
  "name": "Profit Color Optimized",
  "expression": [
    "",
    "/*",
    "    Business Goal: This measure returns a color code (hex) based on the Year-over-Year (YoY)",
    "    change in Profit. It is designed for conditional formatting in reports to visually",
    "    indicate performance trends - green for profit growth, red for profit decline,",
    "    and gray for no change. Unlike numeric measures, this returns a text value",
    "    suitable for font color, background color, or icon conditional formatting.",
    "",
    "    Function Explanation:",
    "    VAR: Used to declare variables that store intermediate calculation results.",
    "    This improves performance and code readability.",
    "*/",
    "VAR Current_Profit = ",
    "    /*",
    "        IFERROR: Evaluates the [Profit] measure and returns it if no error occurs.",
    "        If an error is encountered, it returns BLANK() instead.",
    "        This ensures the measure handles calculation errors gracefully without breaking.",
    "    */",
    "    IFERROR( [Profit], BLANK() )",
    "",
    "VAR Previous_Year_Profit =",
    "    /*",
    "        CALCULATE: Modifies the filter context for the [Profit] measure evaluation.",
    "        SAMEPERIODLASTYEAR: A time intelligence function that takes a date column",
    "        and returns a set of dates from the previous year corresponding to the current",
    "        date context. For example, if viewing Q1 2024, it returns dates for Q1 2023.",
    "        This enables accurate year-over-year comparisons.",
    "    */",
    "    CALCULATE (",
    "        IFERROR( [Profit], BLANK() ),",
    "        SAMEPERIODLASTYEAR ( 'Dates Optimized'[Date] )",
    "    )",
    "",
    "// Calculates the absolute Year-over-Year Change: Current Period - Previous Year",
    "VAR YoY_Change_Absolute = ",
    "    /*",
    "        COALESCE: Returns the first expression that does not evaluate to BLANK.",
    "        Here, it replaces BLANK values with 0 to ensure correct arithmetic operations",
    "        in the subtraction. This prevents errors when either current or previous year",
    "        data is missing.",
    "    */",
    "    COALESCE( Current_Profit, 0 ) - COALESCE( Previous_Year_Profit, 0 )",
    "",
    "RETURN",
    "    /*",
    "        SWITCH: Evaluates multiple conditions and returns one of several result expressions.",
    "        TRUE(): Used as the first argument to enable conditional logic based on the value",
    "        of YoY_Change_Absolute. This structure checks each condition in sequence.",
    "    */",
    "    SWITCH (",
    "        TRUE(),",
    "        // Condition 1: Profit increased (Green) - Favorable",
    "        YoY_Change_Absolute > 0, \"#00A650\", ",
    "        // Condition 2: Profit decreased (Red) - Unfavorable",
    "        YoY_Change_Absolute < 0, \"#E60000\", ",
    "        // Condition 3: No change, zero, or BLANK (Gray) - Neutral",
    "        \"#7F8C8D\" ",
    "    )"
  ],
  "displayFolder": "profit",
  "lineageTag": "2b9264a5-c339-463f-af9a-4e0e7816b4e5"
}