{
  "name": "Max COGS Optimized",
  "expression": [
    "",
    "/*",
    "    Business Goal: In a tabular visualization context (e.g., a month-by-month table),",
    "    this measure returns the COGS value ONLY for the specific row (period) where COGS",
    "    reached its maximum value within the entire currently selected time period (e.g., year).",
    "    All other rows will display BLANK(). This helps quickly identify the peak COGS period",
    "    in a time series visualization.",
    "",
    "    Function Explanation:",
    "    VAR: Used to declare variables that store intermediate calculation results.",
    "    This improves performance and code readability.",
    "*/",
    "VAR Current_COGS = ",
    "    /*",
    "        Retrieves the COGS value for the current filter context (e.g., for the current month/row).",
    "        This is evaluated in the context of each row in the visual.",
    "    */",
    "    [COGS]",
    "VAR Max_COGS_Value =",
    "    /*",
    "        MAXX: An iterator function that iterates over a table and returns the maximum value",
    "        of an expression evaluated for each row.",
    "        ",
    "        ALLSELECTED: Returns all rows in a table, ignoring context filters but keeping",
    "        filters from slicers, report filters, etc. This creates the \"currently selected\"",
    "        context that the user sees in the report.",
    "        ",
    "        Combined, this calculates the maximum COGS value across all dates that are",
    "        currently selected/visible in the report, regardless of the current row context.",
    "        This variable is computed once and reused, improving performance.",
    "    */",
    "    MAXX ( ALLSELECTED ( 'Dates Optimized' ), [COGS] )",
    "",
    "RETURN",
    "    /*",
    "        Two-layer IF statement to control the final output:",
    "        - First, check if there's any COGS value in the current row",
    "        - Then, check if the current row's COGS equals the maximum COGS in the selected period",
    "    */",
    "    IF (",
    "        ISBLANK ( Current_COGS ),",
    "        /*",
    "            ISBLANK: Returns TRUE if the Current_COGS is BLANK.",
    "            If there's no COGS data for the current period, return BLANK.",
    "        */",
    "        BLANK (),",
    "        /*",
    "            Second IF: Compares the current row's COGS with the maximum value.",
    "            If they are equal, this row contains the maximum COGS value.",
    "        */",
    "        IF (",
    "            Current_COGS = Max_COGS_Value,",
    "            /*",
    "                Returns the Current_COGS value only for the row that contains",
    "                the maximum value. This will make only one row (or multiple rows",
    "                in case of ties) display the COGS value in the visual.",
    "            */",
    "            Current_COGS,",
    "            /*",
    "                Returns BLANK() for all rows that don't contain the maximum COGS value.",
    "                This creates a visual effect where only the peak period is highlighted.",
    "            */",
    "            BLANK ()",
    "        )",
    "    )"
  ],
  "displayFolder": "cogs",
  "lineageTag": "d4ebea6d-8971-4301-84f6-591f6dd34a38"
}