{
  "name": "Min COGS Optimized",
  "expression": [
    "",
    "/*",
    "    Business Goal: In a tabular visualization context (e.g., a month-by-month table),",
    "    this measure returns the COGS value ONLY for the specific row (period) where COGS",
    "    reached its minimum value within the entire currently selected time period (e.g., year).",
    "    All other rows will display BLANK(). This helps quickly identify the lowest COGS period",
    "    in a time series visualization, complementing the \"Max COGS Optimized\" measure.",
    "",
    "    Function Explanation:",
    "    VAR: Used to declare variables that store intermediate calculation results.",
    "    This improves performance by calculating values once and reusing them.",
    "*/",
    "VAR Current_COGS = ",
    "    /*",
    "        Retrieves the COGS value for the current filter context (e.g., for the current month/row).",
    "        This is evaluated in the context of each row in the visual.",
    "    */",
    "    [COGS]",
    "VAR Min_COGS_Value =",
    "    /*",
    "        MINX: An iterator function that iterates over a table and returns the minimum value",
    "        of an expression evaluated for each row.",
    "        ",
    "        ALLSELECTED: Returns all rows in a table, ignoring context filters but keeping",
    "        filters from slicers, report filters, and other user selections. This creates",
    "        the \"currently selected\" context that the user sees in the report.",
    "        ",
    "        Combined, this calculates the minimum COGS value across all dates that are",
    "        currently selected/visible in the report. The variable is computed once and",
    "        reused for all row comparisons, providing significant performance optimization.",
    "    */",
    "    MINX ( ALLSELECTED ( 'Dates Optimized' ), [COGS] )",
    "",
    "RETURN",
    "    /*",
    "        Two-layer IF statement to control the final output:",
    "        - First, check if there's any COGS value in the current row",
    "        - Then, check if the current row's COGS equals the minimum COGS in the selected period",
    "    */",
    "    IF (",
    "        ISBLANK ( Current_COGS ),",
    "        /*",
    "            ISBLANK: Returns TRUE if the Current_COGS is BLANK.",
    "            If there's no COGS data for the current period, return BLANK to avoid",
    "            displaying zeros or errors for missing data points.",
    "        */",
    "        BLANK (),",
    "        /*",
    "            Second IF: Compares the current row's COGS with the minimum value.",
    "            If they are equal, this row contains the minimum COGS value.",
    "        */",
    "        IF (",
    "            Current_COGS = Min_COGS_Value,",
    "            /*",
    "                Returns the Current_COGS value only for the row that contains",
    "                the minimum value. This will make only one row (or multiple rows",
    "                in case of ties) display the COGS value in the visual.",
    "            */",
    "            Current_COGS,",
    "            /*",
    "                Returns BLANK() for all rows that don't contain the minimum COGS value.",
    "                This creates a visual effect where only the lowest period is highlighted,",
    "                making it easy to identify cost efficiency peaks.",
    "            */",
    "            BLANK ()",
    "        )",
    "    )"
  ],
  "displayFolder": "cogs",
  "lineageTag": "cb756238-3d75-41fd-a69e-0bf4b9a346af"
}